import React, {useState, useEffect} from "react";
import "./order.css"
import {MuiThemeProvider, createMuiTheme} from '@material-ui/core/styles';
import {Col, Container, Row} from "react-bootstrap";
import DatePicker from 'react-datepicker2';
import momentJalaali from "moment-jalaali";
import Form from 'react-bootstrap/Form'
import {
    Button,
    Radio,
    MenuItem,
    FormControl,
    FormLabel,
    RadioGroup,
    FormControlLabel,
    TextField
} from "@material-ui/core";
import moment from "moment-jalaali";
import {addCommas} from "persian-tools2";

const theme = createMuiTheme({
    direction: 'rtl'
});

const Order = (props) => {
    const [errorMessage, setErrorMessage] = useState("");

    useEffect(() => {

    }, [])



    const descriptionHandler = (event) => {
        setDescription(event.target.value);
        setOrderData({...orderData, orderDescription: event.target.value})
    };



    return (
        <MuiThemeProvider theme={theme}>
            <div className="agreement" dir="rtl">
                <Container>
                    {/*<label className="formLabel">قوانین و مقررات تیسپ</label>*/}
                    <Row>
                        <Col xl={12} lg={12} md={12} sm={12} xs={12}>
                            <h3>ماده 1: تعاریف و اصطلاحات</h3>
                            <span> اصطلاحاتی که در این قوانین و مقررات به کار رفته است دارای معانی مشروح زیر است:</span>
                            <ul>
                                <li>1-1	مشتری: فرد یا افرادی که در برنامۀ تی‌سپ به منظور درخواست خدمات ثبت‌نام کرده‌اند.</li>
                                <li>1-2	کارواشمن: افرادی که جهت شستشوی خودرو به محل اعزام می شوند.</li>
                                <li>1-3	شرکت تی‌سپ: ارائه دهندۀ سرویس تی‌سپ</li>
                                <li>1-4	حساب کاربری: حسابی است که افراد برای استفاده از سرویس تی‌سپ در نرم‌افزار تی‌سپ ایجاد کرده‌اند.</li>
                                <li>1-5	اعتبار: مبلغی است که مشتریان در حساب کاربری خود جهت استفاده از سرویس تی‌سپ دارند.</li>
                                <li>1-6	اطلاعات محرمانه: اطلاعاتی که توسط مشتری و کارواشمن در اختیار تی‌سپ قرار داده می‌شود مانند شماره تماس، مشخصات خودرو، پست الکترونیکی و غیره.</li>
                            </ul>
                            <h3>ماده 2 : حساب کاربری</h3>
                            <ul>
                                <li>2-1	مشتری با ثبت نام در تی‌سپ می‌پذیرد که قوانین و مقررات تی‌سپ را به صورت کامل مطالعه کرده و پذیرفته است. این قوانین ممکن است در طول زمان تغییر کند، استفادۀ مشتریان از تی‌سپ به معنی پذیرش هرگونه تغییر در قوانین و مقررات آن است.</li>
                                <li>2-2	تنها افرادی که بیش از ۱۸ سال سن و واجد اهلیت قانونی باشند می‌توانند اقدام به ساختن حساب کاربری (قابل ایجاد صرفا با شماره موبایل و کد تایید) در تی‌سپ کنند.</li>
                                <li>2-3	مشتری می‌پذیرد اطلاعات خواسته شده را به صورت صحیح و به‌ روز در سرویس تی‌سپ وارد کرده است.</li>
                                <li>2-4	هر فرد تنها می‌تواند یک حساب کاربری به عنوان مشتری در تی‌سپ داشته باشد و استفاده از چند خط تلفن موبایل مجاز نیست. در صورتی که برای تی‌سپ محرز گردد که یک مشتری از دو شماره مجزا اقدام به ایجاد حساب کاربری و ثبت سفارش نموده است، مختار است به تشخیص خود نسبت به بستن حساب کاربری و حذف کلیه اعتبارهای موجود در کیف پول یکی از حساب ها اقدام نماید و از این بابت هیچ گونه اعتراضی مسموع نخواهد بود.</li>
                                <li>2-4	هر فرد تنها می‌تواند یک حساب کاربری به عنوان مشتری در تی‌سپ داشته باشد و استفاده از چند خط تلفن موبایل مجاز نیست. در صورتی که برای تی‌سپ محرز گردد که یک مشتری از دو شماره مجزا اقدام به ایجاد حساب کاربری و ثبت سفارش نموده است، مختار است به تشخیص خود نسبت به بستن حساب کاربری و حذف کلیه اعتبارهای موجود در کیف پول یکی از حساب ها اقدام نماید و از این بابت هیچ گونه اعتراضی مسموع نخواهد بود.</li>
                                <li>2-6	مسئولیت حفظ امنیت دسترسی به حساب کاربری به عهدۀ مشتری است. در صورت مفقود یا سرقت اطلاعات حساب کاربری، مشتری موظف است در اسرع وقت موضوع را به اطلاع شرکت برساند. بدیهی است تا زمانی که اطلاع‌رسانی به شرکت انجام نشده است مسئولیت همۀ فعالیت‌هایی که از طریق حساب کاربری مذکور انجام شده و می‌شود به عهدۀ مشتری خواهد بود. </li>
                                <li>2-7	مشتری حق ندارد از طریق حساب کاربری خود برای خودروی اشخاص دیگر اقدام به ثبت سفارش نماید و در صورت انجام این کار، کلیه مسئولیت های قانونی و کیفری احتمالی بر عهده مشتری ای است که سفارش از طریق حساب کاربری وی ثبت گردیده است.</li>
                                <li>2-8	در شرایط خاصی ممکن است از مشتری برای استفاده از سرویس، درخواست احراز هویت شود، در چنین شرایطی اگر مشتری اطلاعات کافی در اختیار شرکت قرار ندهد، شرکت می‌تواند حساب کاربری وی را مسدود کرده و از ارائۀ سرویس به مشتری خودداری کند.</li>
                            </ul>
                            <h3>ماده ۳:  استفاده از تی‌سپ</h3>
                            <ul>
                                <li>3-1	مشتریان و کارواشمن ها متعهد می‌شوند در حین استفاده از تی‌سپ از استعمال دخانیات امتناع کنند.</li>
                                <li>3-2	با استفاده از سرویس تی‌سپ مشتری می‌پذیرد که از تی‌سپ برای انجام هیچ فعالیت غیر‌قانونی طبق قوانین جمهوری اسلامی ایران یا مخالف با عرف جامعه استفاده نکند. مشتری حق ندارد اشیاء غیر مجاز از جمله مشروبات الکلی، مواد مخدر، سلاح یا سایر اشیاء یا حیواناتی که طبق قانون جمهوری اسلامی ایران مجاز نیست در خودرو خود همراه داشته باشد.</li>
                                <li>3-3	مشتری متعهد می‌شود هیچ‌گاه از سرویس تی‌سپ به صورتی که به تی‌سپ یا شرکای آن صدمه‌ای وارد کند استفاده نکند.</li>
                                <li>3-4	مشتری می‌پذیرد که تی‌سپ ممکن است از ارسال SMS پیامک به عنوان راه ارتباطی شرکت با وی استفاده کند. مشتری می‌تواند درخواست کند که ارسال این پیام‌ها قطع شود اما می‌پذیرد که با انصراف از دریافت این پیام‌ها، ممکن است در استفاده از سرویس با مشکل مواجه شود.</li>
                                <li>3-5	تی‌سپ ممکن است کدهایی به منظور هدیه به مشتری ارائه کند که با وارد کردن این کدها در برنامه، یا درصدی از هزینه شستشو کاسته یا درصدی از هزینه خدمات پس از آن به مشتری برگردانده ‌شود و یا مبلغ مشخصی به حساب مشتری در خدمات اضافه می‌شود.</li>
                                <li>3-6	مشتری می‌پذیرد که اجازۀ انتقال یا فروش کد ها را به افراد دیگر ندارد. همچنین مشتری مجاز نیست این کدها را به صورت عمومی منتشر کند (حتی اگر تی‌سپ در فضاهای عمومی این کد ها را منتشر کرده باشد) مگر اینکه تی‌سپ رسماَ این اجازه را به آنها داده باشد.</li>
                                <li>3-7	مشتری می‌پذیرد اعتباری که در حساب کاربری خود دارد مستقل از روش کسب آن (اگر در نتیجه افزایش اعتبار از طریق درگاه بانک باشد یا در نتیجه وارد کردن کدهای تخفیفی که تی‌سپ در اختیار آنها قرار می‌دهد یا هر روش دیگری) فقط برای استفاده از سرویس تی‌سپ قابل استفاده است و امکان دریافت این وجه را به صورت نقد ندارد.</li>
                                <li>3-8	مشتری می‌پذیرد کدهایی که جهت افزایش اعتبار یا کاهش هزینه خدمات به آنها داده می‌شود ممکن است منقضی شوند. از آنجایی که تی‌سپ برای ارائه این کدها هزینه ای از مشتریان دریافت نمی‌کند، این حق برای شرکت محفوظ است که مبلغ یا درصد تاثیر این کدها را حتی پس از انتشار آنها تغییر دهد یا در صورت لزوم آنها را باطل کند. همچنین درصورتی که شرکت تشخیص دهد که استفاده از این کد به دلیل خطای فنی یا تخلف صورت گرفته و یا غیر قانونی بوده است می‌تواند این کدها یا اعتباری که در نتیجۀ استفاده از آنها به حساب مشتری اضافه شده است را باطل یا حذف کند.</li>
                                <li>3-9	مسئولیت تامین اینترنت و سخت‌افزار لازم و همچنین پرداخت هزینه‌های مربوط به آنها برای استفاده از سرویس تی‌سپ به عهدۀ مشتری است.</li>
                                <li>3-10 مشتری قبل از ارسال درخواست خدمات تمام خودروی خود را چک کرده است و تی‌سپ هیچ گونه تعهدی نسبت به وسایل شخصی مشتری در حین شستشو ندارد.</li>
                                <li>3-11مشتری متعهد می‌شود پس از اتمام شستشو از هیچ بخش از اطلاعاتی که در نتیجه استفاده از سرویس تی‌سپ، از کارواشمن ها کسب کرده است هیچ‌گونه استفاده‌ای نکند. طبعاً ذخیره کردن اطلاعات کارواشمن ها در دستگاه تلفن همراه یا به هر شیوۀ دیگر نیز مغایر با قوانین تی‌سپ خواهد بود. همچنین مشتری متعهد می‌شود در طول خدمات خودرو، فقط در شرایط ضروری از اطلاعاتی که از کارواشمن ها در سرویس تی‌سپ ارائه شده است استفاده کند. استفادۀ مشتری از این اطلاعات باید مطابق با عرف جامعه و قوانین جمهوری اسلامی ایران باشد.</li>
                                <li>3-12با استفاده از سرویس تی‌سپ مشتری می‌پذیرد که در حین شستشو، تی‌سپ را وسیله‌ای برای تبلیغات و بازاریابی کالاهای شخصی خود قرار ندهد و از هرگونه معرفی و عرضۀ محصولات شخصی و یا محصولات متعلق به دیگران خودداری کند.</li>
                                <li>3-13 مشتری می‌پذیرد که متن حریم شخصی تی‌سپ (در انتهای صفحه) را مطالعه کرده است و مورد قبول وی است.</li>
                                <li>3-14 مشتری می‌پذیرد که تی‌سپ خدمات درون شهری نیست بلکه تنها یک خدمات نرم‌افزاری است که ارتباط بین کارواشمن ها و مشتریان را جهت توافق بر انجام یک شستشوی خودرو فراهم می‌کند.</li>
                                <li>3-15 بهتر است برای امنیت بیشتر مشتری، از ارائه سوییچ خود به کارواشمن های تی‌سپ، جهت جابه جا کردن خودرو و اقدامات دیگر پرهیز کند. زیرا تی‌سپ هیچ گونه مسئولیتی در مقابل خسارت وارده به خودروی مشتری را پذیرا نمی باشد.</li>
                            </ul>
                            <h3>ماده ۴: هزینه‌ها و پرداخت</h3>
                            <ul>
                                <li>4-1	مشتری می پذیرد امکان استرداد هزینه‌هایی که مشتری به تی‌سپ می‌پردازد وجود ندارد.</li>
                                <li>4-2	مشتری می‌پذیرد هزینۀ سرویس از طرف تی‌سپ مشخص می‌شود و پس از استفاده از آن اعتراضی نسبت به هزینۀ سرویس نمی‌تواند داشته باشد.</li>
                                <li>4-3	پرداخت هزینۀ سرویس فقط از طریق روش‌هایی که توسط تی‌سپ مشخص می‌شود، می تواند صورت گیرد. این روش‌ها عبارتند از پرداخت اعتباری از داخل برنامۀ موبایل، پرداخت اینترنتی برای افزایش اعتبار و پرداخت نقدی به کارواشمن.</li>
                                <li>4-4	مشتری می‌پذیرد که باید هزینۀ خدمات را مستقل از هر گونه مشکلی که ممکن است در برنامه خدمات جهت پرداخت آنلاین به وجود بیاید به شرکت پرداخت کند. در صورتی که به دلیل مشکلی در برنامه تی‌سپ یا مشکلات ارتباطی از جمله اینترنت و شبکۀ تلفن همراه امکان پرداخت از طریق اپلیکیشن فراهم نشود مشتری همچنان موظف به پرداخت هزینه خدمات خواهد بود. در این شرایط پرداخت هزینه ممکن است با هماهنگی مشتری با دفتر شرکت تی‌سپ یا روش‌های دیگر صورت پذیرد. در صورتی که مشتری به هر دلیلی از جمله مشکلات اپلیکیشن پرداخت را انجام نداده باشد، شرکت حق دارد مبلغ خدمات را از اعتبار مشتری در تی‌سپ کسر کند.</li>
                            </ul>
                            <h3>ماده ۶ : مسئولیت مشتریان و کارواشمن ها</h3>
                            <ul>
                                <li>5-1	 مسئولیت همه اقدامات و افعال مشتریان و کارواشمن ها که ناشی از عدم رعایت قوانین موضوعه جمهوری اسلامی ایران از جمله قانون مجازات اسلامی (ارتکاب جرم در هنگام خدمات) و قوانین مدنی (ورود خسارت به اموال کاربر) باشد، برعهدۀ شخص متخلف بوده و تی‌سپ هیچ گونه مسئولیتی در قبال اعمال و افعال فوق نداشته و نخواهد داشت و تی‌سپ می‌تواند ضمن غیر فعال کردن متخلف، از طریق مراجع صالح اقدامات قانونی را علیه نامبرده نسبت به احقاق حقوق قانونی تی‌سپ بعمل آورد.</li>
                                <li>5-2	هر گونه اقدامی از سوی مشتریان که منجر به ورود خسارت به شهرت تجاری، نام و اعتبار تی‌سپ شود تخلف از شرایط قراردادی و قانونی تلقی و تی‌سپ حق غیر فعال نمودن مشتری و اقدام قانونی علیه وی را جهت مطالبه خسارت و احقاق حقوق قانونی خود خواهد داشت.</li>
                                <li>5-3	کارواشمن متعهد می‌شود تنها از علایم و اقلام سازمانی استفاده کند که توسط تی‌سپ تهیه و در اختیار او گذاشته شده است و مسئولیت استفاده از اقلام و علایمی که سبب ایجاد مشابهت و یا ایجاد اشتباه برای مشتریان و یا سایر اشخاص اعم از حقیقی و یا حقوقی بر عهدۀ وی بوده و در صورت لزوم تی‌سپ به قطع سرویس با نامبرده و پیگیری قانونی اقدام خواهد نمود و شخص متخلف مکلف به جبران خسارات وارده به تی‌سپ خواهد بود.</li>
                                <li>5-4	بعد از درخواست مشتری، کارواشمن ضمن رسیدن به موقع به محل مورد نظر، صرفاً وظیفه شستشوی خودرو به نحو احسن را دارد و در قبال درخواست جدید از سمت مشتری، هیچ گونه مسئولیتی را عهده دار نیست.</li>
                                <li>5-5	کارواشمن حق دریافت هیچ گونه هزینه ای مازاد بر مبلغ اعلامی به مشتری را ندارد. همچنین مشتری حق درخواست خدمات اضافه تر از موارد ثبت شده در سفارش آنلاین را ندارد.</li>
                            </ul>
                            <h3>ماده ۷ : شرایط بار و وسائل همراه مشتری </h3>
                            <ul>
                                <li>وسایلی که مشتری نباید به همراه داشته باشد عبارت است از مواد منفجره، محترقه، مواد سمی، اسیدی، بیماری زا و بد بو، مایعات و جامدات اتش زا و سوختی، مواد و وسایل رادیواکتیو، مشروبات الکلی، بارهای حجیم مانند بسته های بزرگ.</li>
                            </ul>
                            <h3>ماده ۸ : موارد فنی</h3>
                            <ul>
                                <li>8-1	مشتری حق ندارد هیچگونه تلاشی در جهت استخراج سورس کد (Source Code) نرم‌افزارهای تی‌سپ شامل دیکامپایل(Decompile) ، مهندسی معکوس(Reverse Engineering)  یا فعالیتهای مشابه انجام دهد، مگر اینکه اجازۀ چنین کاری به صورت قانونی صادر شده باشد.</li>
                                <li>8-2	مشتری مجاز نیست با استفاده از روشهای Framing یا Mirroring یا روشهای دیگر نسخۀ دیگری از سرویس تی‌سپ را روی سرورهای دیگر ارائه کند. همچنین مشتری مجاز نیست در نرم‌افزار تی‌سپ یا در روش ارائۀ سرویس تی‌سپ تغییر یا اخلالی ایجاد کند.</li>
                                <li>8-3	مشتری حق ندارد برنامه یا اسکریپتی با هدف ایندکس گذاری (Indexing)، مطالعه یا هر گونه فعالیت داده‌کاوی روی سرویس اجرا کند.</li>
                                <li>8-4	مشتری حق ندارد هیچ فعالیتی در راستای حصول دسترسی غیرقانونی و غیر متداول به هیچ بخش سرویس تی‌سپ یا سرویس های مرتبط با تی‌سپ انجام دهد.</li>
                            </ul>
                            <h3>ماده ۹ : محتوای تولید شده توسط مشتریان و کارواشمن ها</h3>
                            <ul>
                                <li>تی‌سپ ممکن است گاهی به مشتریان و کارواشمن ها اجازه دهد که در وب سایت، برنامه موبایل و یا سایر بخش‌های این سرویس عکس، متن، فایل صوتی، فایل تصویری یا فایل‌های مشابه منتشر کنند. مالکیت هر مطلب (شامل متن، عکس، فایل صوتی، فایل تصویری و …) که به این شکل در سرویس ثبت شود همچنان متعلق به مشتریان و کارواشمن ها خواهد بود اما با ثبت آنها در سرویس‌های مرتبط به تی‌سپ این حق را به تی‌سپ میدهند که آنها را در هر مکان و هر زمانی به صورت دیجیتال یا چاپی برای هر نوع کاربردی که صلاح بداند منتشر کند. همچنین تی‌سپ مجاز است حق انتشار این مطالب را به اشخاص یا شرکت‌های دیگر منتقل کند.</li>
                            </ul>
                            <h3>ماده ۱۰ : قطع سرویس</h3>
                            <ul>
                                <li>تی‌سپ در شرایطی که به هر دلیل به این نتیجه برسد حضور یک کارواشمن یا مشتری می تواند برای شرکت یا سایر کارواشمن ها و مشتریان خطرناک باشد یا مطلوب نباشد حق حذف دسترسی مشتری مذکور به سرویس تی‌سپ را دارد.</li>
                            </ul>
                            <h3>ماده ۱۱ : توافق از راه دور</h3>
                            <ul>
                                <li>11-1	مشتری توافق میکند جهت مبادلۀ آسان اطلاعات، همۀ تغییرات و الحاقیه‌های قوانین و مقررات حاضر اعم از تغییر و اضافه کردن شروط آن، ارسال اخطاریه و ابلاغیه‌های مربوط به تی‌سپ، از طریق سیستم رایانه‌ای تی‌سپ بعمل آید و مشتری ضمن پذیرش اطلاع از شرط و روند اجرایی آن موافقت خود را نسبت به اعمال شرط مذکور اعلام میکند</li>
                                <li>11-2	 مسئولیت حفظ و حراست از حساب مشتری برعهدۀ مشتری بوده و مشتری ضمن پذیرش این مسئولیت، همۀ داده ها و پیام‌های صادره از طریق حساب کاربری مذکور را منتسب به خود دانسته و هرگونه ادعایی نسبت به انکار، تردید و جعل داده پیام‌های ارسال شده از ناحیۀ نامبرده غیر قابل استماع و مردود است.</li>
                                <li>11-3	مشتری می پذیرد هر گونه رویه، اشکال، عبارات مبین تائید و اعلام قبولی و تصدیق داده پیامهای صادره از طرف تی‌سپ به منزله امضا الکترونیکی و قبولی محسوب میشود و هر گونه ادعائی نسبت به امضا و قبولی مذکور غیر قابل استماع و مردود است.</li>
                                <li>11-4	مشتری با عضویت در سرویس تی‌سپ قصد و اراده خود را نسبت به پذیرش انعقاد هرگونه اقدام و عمل حقوقی از جمله عقود و معاملات از راه دور و از طریق سیستم رایانه‌ای و الکترونیکی اعلام میکند.</li>
                            </ul>
                        </Col>
                    </Row>
                </Container>
            </div>
        </MuiThemeProvider>
    );
}
export default Order